{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"activation": "sigmoid", "activity_regularizer": null, "batch_input_shape": [null, 2], "trainable": true, "name": "dense_1", "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "activity_regularizer": null, "trainable": true, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "activity_regularizer": null, "trainable": true, "name": "dense_3", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "trainable": true, "name": "dense_4", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true}}]}}