{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"name": "dense_1", "dtype": "float32", "batch_input_shape": [null, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 2, "activation": "sigmoid", "trainable": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 6, "activation": "sigmoid", "trainable": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 4, "activation": "sigmoid", "trainable": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 4, "activation": "linear", "trainable": true, "activity_regularizer": null}}]}, "keras_version": "2.2.4"}