{"config": {"name": "sequential_1", "layers": [{"config": {"use_bias": true, "trainable": true, "batch_input_shape": [null, 2], "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 12, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "trainable": true, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 37, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "trainable": true, "name": "dense_3", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 61, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "trainable": true, "name": "dense_4", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 43, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "trainable": true, "name": "dense_5", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 37, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "trainable": true, "name": "dense_6", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 14, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "trainable": true, "name": "dense_7", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 3, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "activation": "tanh", "kernel_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}