{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "units": 6, "kernel_constraint": null, "name": "dense_1", "dtype": "float32", "use_bias": true, "batch_input_shape": [null, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "units": 4, "kernel_constraint": null, "name": "dense_2", "activation": "sigmoid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "units": 2, "kernel_constraint": null, "name": "dense_3", "activation": "sigmoid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "units": 4, "kernel_constraint": null, "name": "dense_4", "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}}