{"backend": "tensorflow", "config": {"layers": [{"config": {"batch_input_shape": [null, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "units": 2, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "units": 6, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_3", "units": 2, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_4", "units": 4, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_5", "units": 4, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "activation": "tanh"}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential"}