{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"bias_constraint": null, "batch_input_shape": [null, 2], "use_bias": true, "trainable": true, "activation": "sigmoid", "activity_regularizer": null, "dtype": "float32", "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "trainable": true, "activation": "sigmoid", "activity_regularizer": null, "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "trainable": true, "activation": "sigmoid", "activity_regularizer": null, "units": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "trainable": true, "activation": "linear", "activity_regularizer": null, "units": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}]}}