{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "use_bias": true, "trainable": true, "kernel_constraint": null, "batch_input_shape": [null, 2], "kernel_regularizer": null, "units": 2, "activation": "sigmoid", "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "units": 6, "activation": "sigmoid", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_3", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "units": 4, "activation": "sigmoid", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_4", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "units": 4, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}, "class_name": "Sequential"}